.PHONY: run clean

CFLAGS = -g -O0  # Флаги компилятора

run: fibonacci  # Цель "run" зависит от цели "fibonacci"
	./$<  # Выполнить файл, который является первой зависимостью цели

fibonacci: fibonacci.o function.o  # Цель "fibonacci" зависит от целей "fibonacci.o" и "function.o"
	$(CC) $(CFLAGS) -o $@ $?  # Команда для создания исполняемого файла из объектных файлов

%.0 : %.c  # Правило для создания объектного файла из исходного файла на языке Си
	$(CC) -c $(CFLAGS) $< -o $@  # Команда для компиляции исходного файла в объектный файл

clean:  # Цель "clean" не имеет зависимостей
	rm -rf *.o *~ fibonacci  # Команда для удаления временных файлов
